2017/Maksim Golubev/HW4/app/controllers/sell_posts_controller.rb

SELECT  `sell_posts`.* FROM `sell_posts` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `sell_posts`
---
  def index
    @sell_posts = SellPost.paginate(:page => params[:page], :per_page => 5)

INSERT INTO `sell_posts` (`title`, `body`, `phone`, `name`, `sell_currency`, `created_at`, `updated_at`) VALUES ('234', 'dsfsf', 'test', 'testt', 0, '2017-12-05 15:07:46', '2017-12-05 15:07:46')
---
  def create
    @sell_post = SellPost.new(sell_post_params)

    respond_to do |format|
      if @sell_post.save

SELECT  `sell_posts`.* FROM `sell_posts` WHERE `sell_posts`.`id` = 1 LIMIT 1
---
    def set_sell_post
      @sell_post = SellPost.find(params[:id])