i = 0
j=1
s=" "
a= "wow"
b="much code"
c="so ruby"
d="should I add some"
lol="LoL"
f="how to move this fucking LOL"
r="А русский покатит?"

while i<= 7
puts s*i*2+a
puts s*i*2+b
puts s*i*2+c
puts s*i*3+d
puts lol
sleep 0.2
system("clear")
puts s*i*2+a
puts s*i*2+b
puts s*i*2+c
puts s*i*3+d
puts lol
sleep 0.2
system("clear")
i+=1
end
while i<= 20
puts s*i*2+a
puts s*i*2+b
puts s*i*2+c
puts s*i*3+d
puts lol
puts s*i*2+f
puts s*i*4+r
puts s*i*3+"О, нормас, катит."
sleep 0.2
system("clear")
i+=1
end
while i<=40
puts s*i*2+a
puts s*i*2+b
puts s*i*2+c
puts s*i*3+d
puts s*j*4+lol
puts s*i*2+f
puts s*i*4+"Почему быстрее двигается сейчас, или это я с ума схожу потихоньку?"
sleep 0.2
system("clear")
i+=1
j+=1
end
puts "
 XXXXXXXX         X             X    X XXXXXXX      XX         XX
XX     XX        XX            X    XXX      XXX    XX       XXX
 X      XX        XX           X     X         XX    XX     XXX
 X       X         X           X     X          X     XX  XXX
 X     XXX         X           X     X        XXX      XXXX
 XXXXXXX           X           X     X   XXXXXX        XXX
 X XXX             X           X     X    XXX          XX
 X   XXX           XX         XX     X      X           X
 X     XXX          XX       XX      X      X           X
 X       XXX         XX    XXX       XX    XX           X
 X         X          XXXXXX          XXXXXX            X
"
sleep 2
system("clear")
puts "               XX              XX                XX            X
 XXXXXXXX        XX             X    X XXXXXXX     XXX         XX
 XX     XX        XX            XX   XXX      XXX    XX       XXX
  X      XX        XX           XX    X         XX    XX     XXX
  X       X         X           XX    X          X     XX  XXX
  X     XXX         X           X     X        XXX      XXXX
  XXXXXXX           X           X     X   XXXXXX        XXX
  X XXX             X           X     X    XXX          XX
  X   XXX           XX         XX     X      X           X
  X     XXX          XX       XX      X      X           X
  X       XXX         XX    XXX       XX    XX           X
  X         X          XXXXXX          XXXXXX            X
"
sleep 1
system("clear")
puts "                                                X
                                                 XX
               XX                XX               X              X
                XX                X               X           XXXX
               XXX                XX             XX           XX
               XX                  X             X             XX
                X                XXX             XX             X
                XX              XX                XX            X
   XXXXXXXX        XX             X    X XXXXXXX     XXX         XX
   XX     XX        XX            XX   XXX      XXX    XX       XXX
   X      XX        XX           XX    X         XX    XX     XXX
   X       X         X           XX    X          X     XX  XXX
   X     XXX         X           X     X        XXX      XXXX
   XXXXXXX           X           X     X   XXXXXX        XXX
   X XXX             X           X     X    XXX          XX
   X   XXX           XX         XX     X      X           X
   X     XXX          XX       XX      X      X           X
   X       XXX         XX    XXX       XX    XX           X
   X         X          XXXXXX          XXXXXX            X   "
sleep 1
system("clear")
puts "                                                   XXXXXXX
                                                    XXXXX     XXX
                                               XXXXXXXXXXXXXXXXXXXXX
                                                       XXXXX  XXX XXX
                     XXXX         XXXXXXXXXX    XXXXXXXXXXXXXXXXXX  XXXX
                     XXXXXX      XXXXXXXXX XX           X XX    XX  XXXX
     X X X         XXXXXXX     XXXXXXXXX  X          XX           XX
     XXXXXXXXX      XXXXXXX     XXXXXXXXX XX          X             XX
     XXXXXXXXX      XXXXXX      XXXXXXXXXX           XX             X
      XXXXXXXXXXX     XXXXXX       XXXXX XX             XX            X
      XXXXXXXXXXXX     XXXXX        XXXXXX X XXXXXXX     XXX         XX
      XXX     XXXXX     XXXX        XXXX   XXX      XXX    XX       XXX
      XXX      XXXX      XX           XX    X         XX    XX     XXX
      XXX       XXX       X XXX  XXX  XX    X          X     XX  XXX
      XXX     XXXX        X XXX  XXX  X     X        XXX      XXXX
      XXXXXXXXX           X           X     X   XXXXXX        XXX
     XXXX XXXXX           X  X    XX  X     X    XXX          XX
     XXXX   XXXX          XX XXXXXX  XX     X      X           X
     XXXX     XXXXX        XX       XX      X      X           X
     XXXX       XXXX        XX    XXX       XX    XX           X
     XXXX         XXX        XXXXXX          XXXXXX            X
                                                                 "
sleep 2
system("clear")
puts "
                                                   `:+@@@':,
                                            .#@@@@@@';;;;#@@@@@+
                                       :@@@@@+:`              .#@@@:
                                     @@@#`                        +@@#
                                  `@@@                               #@@
                                :@@'                                   +@@.
                              .@@,                                       ;@@
                             @@,                                           +@'
                           ,@#           #@@@@.                              @@
                          @@.          #@@@@@@@                               ;@'
                        `@@          #+     @@@+                           `,   @@
                       ,@:                   @@@                         `@@@@   @@
                      +@                      @@                        ,@@@+;#;  #@
                     @@                                                 @@@:       +@
                    @#                                                  @@#         #@
                   @+                                                   ,`           @#
                 `@+                                                                  @,
                '@,                                                                   `@
               +@                `#@@+@@@+,                                            #@
              #@               `@.         #@.                                          @`
             @@               #:          @@@@+                              :#@@.      '@
            '@               #.          '@@@@:,#                          @'    `@@     @.
           ,@               #`           ,@@@@@@ ;                       ,@         @.   ,@
           @`              #`    :@@#':,,;+@@@@;+#                      :;         @@@'   @
          @;              .,  `@#                @                    , @`        `@@@@+  +@
         @@               @ :@,                 @                     `;` .'##@@@+,@@@@#:  @
        ,@             ,.,.@`                  ;`                       #.         `;@@@@  @'
        @.            .;;@.                   .`                        ,              .@+ .@
       '@             , `'                   '.                          +               ;  @
       @`                 #                                               @                 @.
      +@                    :#                                             #             '  +@
      @`                       ;                                            @            `   @
     `@                                                                      .+,        :    @`
     @+                                                                         ,            @'
     @                                                                                       ;@
    ,@                                          .                                            `@
    @+                                        .#                       :                      @
    @`                                        #`                        ,`                    @.
    @                                        ;                           '@                   #;
   `@                                      :;                              +`                 :@
   ##                                     @;              `@#:,,#;@@:       `;                 @
   @.                                    #              '@``    #    @#                        @
   @                                    ,`            @+   .    +    ` @      .                @
   @                                    @           @: ,   :    +       @     ,                @
   @                                    #         #@   @   @    #   .    @    '                @
   @                                   `#      '@#  #  @; `@+;;@@`  @  .  @.  +                @`
   @                                   :@#@@#@++  , `@@@@@@@@@@@@@@@@  '  `++ +                @.
   @                                   , ..##; `   @@@@@@@@@@@@@@@@@@@`@ @ ''@#                #,
   @                                   .     @  # #@@@@@@@@@@@@@@@@@@@@@@+: @ @                #,
   @                                   +`     @``@@@@@@@@@@@@@@@@@@@@@@@@@#., #                #,
   @                                    `      ;@@@@@@@@@@@@@@@@@@@@@@@@@@@@  +`               #,
   @                                            ;@@@@@@@@@@@@@@@@@@@@@@@@@@+  ;                #,
   @                                              @@@@@@@@@@@@@@@@@@@@@@@@@   ,                #,
   @                                               :@@@@@@@@@@@@@@@@@@@@@@                     @,
   @.                                                .@@@@@@@@@@#@@;@@@@@.                     @.
   ##                                                   .;@@; #; `'#@@@,                       @
   `@                                                        .::,`                             @
    @                                                                                          @
    @.                                                                                        ,@
    +@                                                                                        @'
     @                                                                                        @
     @'                                                                                       @
     `@                                                                                      ##
      @:                                                                                     @`
      .@                                                                                     @
       @@                                                                                   '@
"
sleep 2
system("clear")
puts "          <=
         <<=
        <<<=
         <<=
           =
    <<===========
~~~~~<===========~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.2
system("clear")
puts "         <=
        <<=
       <<<=
        <<=
          =
   <<===========
~~~~<===========~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "        <=
       <<=
      <<<=
       <<=
         =
  <<===========
~~~<===========~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "      <=
     <<=
    <<<=
     <<=
       =
<<===========
~<===========~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "     <=
    <<=
   <<<=
    <<=
       =
|<===========
<===========~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "    <=
   <<=
   <<<=
     <<=
       =
<<===========
~<===========~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "    <=
    <<=
    <<<=
      <<=
        =
 <<===========
~~<===========~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "      <=
     <<=
     <<<=
       <<=
         =
  <<===========
~~~<===========~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "       <=
       <<=
       <<<=
        <<=
          =
   <<===========
~~~~<===========~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "         <=
        <<=
        <<<=
         <<=
           =
    <<===========
~~~~~<===========~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 0.32
system("clear")
puts "           <=
          <<=
         <<<=
          <<=
            =
     <<===========
~~~~~~<===========~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
sleep 2
system ("clear")
puts "        `;;;`
                                 .;+@@',     `@@
                             `+@'`              ,@
                           :@.                    +,
                        .##`                       `@
                     ``@.                            @
                     #:                               @`
                    '`                                 @
                   ,:                     .,;@'         @
                  ,;                  ,#@,.`    '@;     ,`
                 .;                    .`;;#@@@,  '@@`   @`
                 @     ,        `;:+@@,`.    `+@;,    ,;'@;
                @      .  :   .+@@;;.,;;@@@'@`    `;@@@@+ @
               ,,     +    @@@@@'.  ..   `  @`,@@@@@+.    .`
               @      #        ,'@@@@@+'      ,            #
              :                 :@@@,.::    .    #@#::',   @
              @                +`   `#;     `#  @   ,  @   @
             ``               '.  `;  #       '  #   ,#@   '
             @         .;'@;  :.   .  ;       '   '';       :
             +        +.,    ' `:#';;@@       .   :#@'::    +
            `.                :@+:  ``        @   `, .      @
            ,                   :@#,,      `  +      #:     :
            ;                 ` .@@`      @@  :            ``.
            :                       `     '@@ '              ;
            :      .             :@'.         @  `:          +
            ``    @            `@    `        @    @'@       @
             ;   `,           `#@  `@,      ; ,`  . ,+:`     @
             '   : @`        `;'    +`#        @  `'  :`     #
             @`    @         @      `.'        .   `` @      .
             @     :        ,`        @        ,.     .      .
             @     :        `         @.`    `@; ;           .
             +            ;        @    #@;'@:   `#          .
             ;           @      ``#              ``.         .
              #          `       @               ` #         .
              @                 ,     `@@@@@@@:     '        #
              `@                #    ,@.      ,@@   @        @
               +                +    @` ,@@``   ,:`          @
                :               '   @,     ,.    #           #
                @               ,, `                        ,
                `                                           @
                 @ :@@@@@@;.  `                             +
                 :@@@;,:+@@@@@+         `'',`         #@@@@@,
                 #@@@        '@@@@`   ;@@@@+@@@     '@@@@@@@@@`
                 @@@@.         `@@@@@@@@@@,  @@;   ,@@@@@@   @@:
                  +@@@,     :@@  .@@@@@@@'   .@@   @@@@@@    @@@
                   ``` #@` @` @` +;@@@@@.    @@@@@@@@@@@;   :@@@
                         ,@  : ,;:,@@@#   ` #@@@@@@@@@@+    @@@@
                        `@   + # ' @,:    `@@@@@ `@@@@@    #@@#@
                        '`   @@  @+`;    :@@@@@@+`  @@@@'`'@@@@#
                       .:    @   @, @#; @@#@@@@`     #@@@@@@@@@
                       @         ,  @`@@@@@@@@         :@@@@#`
                      .;             @,#+'#.
                      +             ,`    @.
                      #             @     `@
                      @            #       @
                      @           @        @
"
