2017/DenisNikolsky/4/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    @article.save
---
INSERT INTO "articles" ("title", "text", "contact_details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Bosntick"], ["text", "Bitcoin vs Bonstick!"], ["contact_details", "+45464545"], ["created_at", "2017-11-28 13:08:41.497951"], ["updated_at", "2017-11-28 13:08:41.497951"]]