WHERE_SEMESTER_STARTS = 'Когда начинаем учиться?'.freeze
WHERE_SEMESTER_ENDS = 'Когда надо сдать все лабы?'.freeze
WHAT_SUBJECT = 'Какой предмет учим?'.freeze
HOW_MANY_LABS = 'Сколько лаб надо сдать?'.freeze
START_MESSAGE = 'Привет. "\
  "Я тебе смогу помочь сдать все лабы, чтобы мамка не ругалась. '\
  "Смотри список что я умею:\n"\
  "/start - выводит приветствие и описание всех доступных команд.\n"\
  "/semester - запоминает даты начала и конца семестра.\n"\
  "/subject - добавляет предмет и количество лабораторных работ по нему.\n"\
  "/status - выводит твой список лаб, которые тебе предстоит сдать.\n"\
  '/reset - сбрасывает для пользователя все данные.'.freeze
TRY_VALID_DATE = 'Попробуй дату в формате 07.1.1994'.freeze
TRY_INTEGER = 'Попробуй целое число'.freeze
TODAY_YOU_MUST = "К сегодняшнему дню ты должен сделать:\n".freeze
YOU_HAVE_DAYS = 'На все про все у нас %d дня.'.freeze
STATUS = "%d из %d лаб по %s\n".freeze
EXCEPTION_MESSAGE = 'Проблемы с доступом к ДжойКазино?'\
  "\nДобавьте 1, чтобы получилось джойказино1.ком".freeze
