{"Neil Patrick Harris":"Neil Patrick Harris was born in Albuquerque, New Mexico, on June 15, 1973. His parents, Sheila Gail (Scott) and Ronald Gene Harris, were lawyers and ran a restaurant. He grew up in Ruidoso, New Mexico, a small town 120 miles south of Albuquerque, where he first took up acting in the fourth grade. While tagging along with his older brother of 3 years...","Sarah Paulson":"Sarah Paulson was born on December 17, 1974 in Tampa, Florida, to Catharine Gordon (Dolcater) and Douglas Lyle Paulson II. She spent most of her early years in New York and Maine, before settling in Manhattan to attend the American Academy of Dramatic Arts and the High School for Performing Arts. Although...","Wanda Sykes":"Wanda Sykes has been called one of the funniest stand-up comics by her peers and ranks among Entertainment Weekly's 25 Funniest People in America. Her smart-witted stand-up has sent her career in many different areas. She was recently seen in Comedy Central's Wanda Does It, where she tried various non-showbiz jobs...","David Burtka":"Wentworth Miller is a compelling and critically acclaimed actor whose credits span both television and feature film. Wentworth Earl Miller III was born June 2, 1972 in Chipping Norton, Oxfordshire, England, to American parents, Joy Marie (Palm), a special education teacher, and Wentworth Earl Miller II...","Wentworth Miller":"Alan Cumming was born on January 27, 1965, in Aberfeldy, Scotland, to Mary (Darling), an insurance company secretary, and Alex Cumming. His family lived nearby in Dunkeld, where his father was a forester for Atholl Estate. The family (including his brother, Tom) moved to Fassfern near Fort William, before moving to the east coast of Scotland in 1969...","Alan Cumming":"Zachary Quinto was born in Pittsburgh, Pennsylvania, to Margaret J. (McArdle), an Irish-American office worker, and Joseph John Quinto, an Italian-American barber. Zachary graduated from Central Catholic High School in Pittsburgh, with the class of 1995, where he won Pittsburgh's Gene Kelly Award...","Cherry Jones":"Ellen Philpotts-Page was born on February 21, 1987, in Halifax, Nova Scotia, to Martha Philpotts, a teacher, and Dennis Page, a graphic designer. Page wanted to start acting at an early age and attended the Neptune Theater School. She began her career at the age of 10 on the award-winning television series Pit Pony...","Jane Lynch":"Lady Gaga, born Stefani Joanne Angelina Germanotta, is an American songwriter, singer, actress, philanthropist, dancer and fashion designer. Gaga was born on March 28, 1986 in Manhattan, New York City, to Cynthia Louise (Bissett) and Joseph Anthony Germanotta, Jr., an internet entrepreneur. Her father is of Italian descent...","Zachary Quinto":"Megan Denise Fox was born in Rockwood, Tennessee, to Gloria Darlene (Cisson) and Franklin Thomas Fox, a parole officer. Megan began her training in drama and dance at age 5 and, at age 10, moved to St. Petersburg, Florida where she continued her training and finished school. Megan began acting and modeling...","Ellen Page":"Amber Laura Heard was born in Austin, Texas, to Patricia Paige Heard (Parsons), an internet researcher, and David C. Heard (David Clinton Heard), a contractor. She has English, Irish, Scottish, German, and Welsh ancestry. Heard appeared in the Academy Award-nominated film, North Country, in which she played Charlize Theron's character in flashbacks...","Chris Colfer":"Angelina Jolie is an Academy Award-winning actress who became popular after playing the title role in the \"Lara Croft\" blockbuster movies, as well as Mr. & Mrs. Smith, Wanted, Salt and Maleficent. Off-screen, Jolie has become prominently involved in international charity projects...","Lady Gaga":"Widely regarded as one of greatest stage and screen actors, both in his native Great Britain and internationally, twice nominated for the Oscar and recipient of every major theatrical award in UK and US, Ian Murray McKellen was born on May 25, 1939 in Burnley, Lancashire, England, to Margery Lois (Sutcliffe) and Denis Murray McKellen...","Megan Fox":"Matthew Staton Bomer was born in Webster Groves, Greater St. Louis, Missouri, to Elizabeth Macy (Staton) and John O'Neill Bomer IV, a Dallas Cowboys draft pick. Matt was raised in Spring, Texas, and educated at Klein High School, near Houston. After school, he attended Carnegie Mellon University in Pittsburgh...","Amber Heard":"Emmy-winning talk show host Ellen Lee DeGeneres was born in Metairie, Louisiana, a New Orleans suburb. She is the daughter of Betty DeGeneres (née Elizabeth Jane Pfeffer), a speech therapist, and Elliott Everett DeGeneres, an insurance agent. Her brother is musician and producer Vance DeGeneres. Her parents divorced when she was sixteen years old...","Angelina Jolie":"Fiona Shaw was born July 10, 1958 in County Cork, Ireland. She attended secondary school at Scoil Mhuire in Cork City, and later received a degree in University College Cork. She was trained at the Royal Academy of Dramatic Art (RADA) in London and was part of a contingent of actors to emerge from the college who were considered 'new wave'...","Ian McKellen":"Portia de Rossi was born and raised in Geelong, Australia. Originally born Amanda Rogers, at 15 she changed her name to Portia, saying that it was the most daring thing she had ever done up until that point. After graduating from high school, she attended the University of Melbourne, and studied law...","Matt Bomer":"Alicia Christian Foster was born in Los Angeles on November 19, 1962. She is the daughter of Evelyn Ella \"Brandy\" (Almond) and Lucius Fisher Foster III, an Air Force lieutenant colonel and later real estate broker. Brandy had filed for divorce in 1959 after having three children with Lucius, but the exes had a brief re-encounter in 1962 which resulted in Alicia's birth...","Meredith Baxter":"Cynthia Nixon was born in New York City on April 9, 1966, to Anne Elizabeth Knoll, an actress, and Walter E. Nixon, Jr., a radio journalist. She has German and English ancestry. Nixon made a memorable film debut in Little Darlings. Her Broadway credits include \"The Last Night of Ballyhoo,\" \"Indiscretions,\"...","Ellen DeGeneres":"Often considered hip-hop's first lady (though some would attribute that to Roxanne Shanté), the woman behind the moniker Queen Latifah was born Dana Owens on March 18th, 1970, in East Orange, New Jersey. She is the daughter of Rita (Bray), a teacher, and Lancelot Owens, Sr. She came from a police family--both her father and older brother were cops...","Fiona Shaw":"Rosie O'Donnell was born into an Irish-American family in Commack, Long Island. She is the middle of 5 children, and is the daughter of Roseann Teresa (Murtha) and Edward Joseph O'Donnell, an electrical engineer for the defense industry. Her mother died when she was ten. She said that she watched TV nearly 24 hours a day...","Portia de Rossi":"Sara Gilbert was born on January 29, 1975, as Sara Rebecca Abeles at St. John's Hospital and Health Center in Santa Monica, California, to Harold and Barbara Abeles. Barbara was previously married to the late Paul Gilbert. At the age of six, when Sara saw her sister Melissa Gilbert get a star on the Hollywood Walk of Fame...","Jodie Foster":"Born and raised in Puerto Rico, Ricky initiated his singing career in the Latin all boy-band group Menudo. After leaving the group, he moved to New York to study acting. After finishing his studies, he relocated to Mexico where he performed as actor in \"Mama ama el Rock\", \"Alcanzar una Estrella II\"...","Cynthia Nixon":"Having grown up in Houston, and its northern suburb of Spring, he made his first stage appearance in a school play at the age of 6. Parsons then went on to study theater at the University of Houston. From there he won a place on a two-year Masters course in classical theater at the University of San Diego/The Old Globe Theater, graduating in 2001...","Queen Latifah":"Sir Elton John is one of pop music's great survivors. Born 25 March, 1947, as Reginald Kenneth Dwight, he started to play the piano at the early age of four. At the age of 11, he won a scholarship to the Royal Academy of Music. His first band was called Bluesology. He later auditioned (unsuccessfully) as lead singer for the progressive rock bands King Crimson and Gentle Giant...","Rosie O'Donnell":"Tom Ford is an American fashion designer, film director, screenwriter and film producer. He gained fame as the creative director at Gucci and Yves Saint Laurent. In 2006, Ford launched his own \"Tom Ford\" label. Ford directed the films A Single Man (2009) and Nocturnal Animals (2016), both films were Oscar-nominated...","Sara Gilbert":"Heather Matarazzo was born November 10, 1982, in Oyster Bay, New York. She was adopted by Camille and Ray Matarazzo, an Italian-American couple (she is of Irish descent birth). Heather attended Oyster Bay High School, as well as the Long Island High School for the Arts. In 1997, she made her film debut in Welcome to the Dollhouse...","Ricky Martin":"Carrie Brownstein was born on September 27, 1974 in Seattle, Washington, USA. She is a founding member of the rock band Sleater-Kinney, and was formerly in the band Excuse 17. Alongside Fred Armisen, she is the writer, actress and co-developer of the sketch comedy show Portlandia on IFC TV.","Jim Parsons":"Known for tough-chick roles, Michelle Rodriguez is proof that there is a cross between beauty and brawn. She was born Mayte Michelle Rodriguez on July 12, 1978, in Bexar County, Texas, to Carmen Milady Pared Espinal, from the Dominican Republic, and Rafael Rodríguez Santiago, who served in the U.S. Army and was originally from Puerto Rico...","Elton John":"Anna Paquin is the first millennial to have received an Academy Award nomination for acting, and the first to win. She was born in Winnipeg, Manitoba, Canada, in 1982, to Mary (Brophy), an English teacher from Wellington, New Zealand, and Brian Paquin, a Canadian phys-ed teacher. Anna moved to her mother's native country when she was four years old...","Tom Ford":"Stacy Ann Ferguson was born in Hacienda Heights, California, to Theresa Ann (Gore) and Jon Patrick Ferguson, both schoolteachers. Her ancestry includes Scottish, English, Irish, German, Swedish, and Luxembourgian. When she was a teenager, her parents divorced, which was a big challenge for a girl who wanted to be a star...","Heather Matarazzo":"Clive Davis was born in Brooklyn, New York. He entered Harvard Law School on a full scholarship and graduated in 1956. Four years later, he arrived at Columbia Records as an attorney. In 1965, he was promoted to administrative vice-president of the label, became vice-president and general manager a year later...","Carrie Brownstein":"John Michael Stipe was born in Decatur, Georgia, on January 4th, 1960. Since his father was in the military, they moved around a lot. In 1980, while he was attending the University of Georgia (studying painting and photography), he met Mike Mills, Peter Buck and Bill Berry. They dropped out of school to form R.E.M....","Michelle Rodriguez":"Victor Garber has been in some of the most memorable projects of the past four decades. Victor is currently appearing in The Slap, The Flash, Motive and Web Therapy. He will soon star in Greg Berlanti's new Untitled DC Comics Superhero series for Warner Bros/CW. He has shared in two Screen Actors Guild (SAG) Award® nominations for Outstanding Motion Picture Cast...","Anna Paquin":"Matthew Joseph \"Matt\" Dallas born October 21, 1982 is an American actor, best known for playing the title character on the ABC Family series Kyle XY. Dallas was born in Phoenix, Arizona, and attended Arizona School for the Arts. He has two younger brothers and one younger sister. He became interested in acting at the age of 12...","Fergie":"Ezra Matthew Miller was born in Wyckoff, New Jersey, to Marta (Koch), a modern dancer, and Robert S. Miller, who has worked at Workman Publishing and as former senior VP for Hyperion Books. He has two older sisters. Ezra is of Ashkenazi Jewish (father) and German-Dutch (mother) ancestry; he has described himself as Jewish and \"spiritual\"...","Clive Davis":"Raven-Symoné Pearman was born in Atlanta, Georgia, to Lydia (Gaulden) and Christopher Pearman. At a young age, she moved to New York. While there Raven signed with the Ford Modeling Agency. They sent her out on a audition for a movie called Ghost Dad, which also starred the legendary Bill Cosby...","Jillian Michaels":"Maria Bello was born on 18 April, 1967 in Norristown, Pennsylvania, to Kathy, a nurse and teacher, and Joe Bello, a contractor. She is of Italian and Polish descent. Maria went to Villanova University, majoring in political science. She had every intention of becoming a lawyer, but she took an acting class during her senior year...","Michael Stipe":"Kristian Nairn is a Northern Irish Actor and Musician. He is a successful DJ, having performed alongside acts such as the Scissor Sisters. He has worked Worldwide. Game of Thrones marks Nairn's first major acting role. He plays the role of the enigmatic fan favorite character, Hodor. He also appeared as a guest on episode 37 of the comedy podcast the Yogpod...","Anderson Cooper":"Lily Tomlin was born September 1, 1939 in Detroit, Michigan, to Lillie Mae (Ford) and Guy Tomlin, who moved to Michigan from Paducah, Kentucky, during the Great Depression. Her mother was a nurse's aide and her father was a factory worker. She graduated from Cass Technical High School in 1957, and later enrolled at Wayne State University...","Tracy Chapman":"Jonathan David Bennett was born in Rossford, Ohio, to RuthAnne (Mason) and Dr. David Paul Bennett. He headed straight to New York to pursue acting after graduating from the theater program at Otterbein. He was actually discovered by an agent while sitting on a train. Six months later he signed on to the iconic soap opera \"All My Children,\" playing J.R...","Alice Walker":"Although primarily known for playing Hikaru Sulu in the television series Star Trek and the first six features, George Takei has had a varied career acting in television, feature films, live theater and radio. He also is a successful writer and community activist. George Takei was born Hosato Takei on April 20...","Victor Garber":"Thomas (Tom) Loren Lenk was born in Westlake Village, California, USA on June 16th, 1976. Tom attended Moorpark College until his junior year, then transferred into UCLA's theater program. It wasn't long before others began to notice Tom's talent, and in 1997 Tom won the Carol Burnett Award and Scholarship...","Melissa Etheridge":"Since melting audiences' hearts - at the age of six - in Steven Spielberg's beloved sci-fi blockbuster, E.T. the Extra-Terrestrial, Drew Barrymore has emerged as one of the most endearing and talented actresses of her generation. Drew Blyth Barrymore was born in Culver City, California, to actors John Drew Barrymore and Jaid Barrymore (née Ildiko Jaid Mako)...","Matt Dallas":"Gillian Anderson was born in Chicago, Illinois, to Rosemary Alyce (Lane), a computer analyst, and Homer Edward Anderson III, who owned a film post-production company. She has English, German, and Irish ancestry. Gillian started her career as a member of an amateur actor group while at high school. In 1987...","Ezra Miller":"Ocean was born Christopher \"Lonny\" Breaux in Long Beach, California. When he was around 5 years old, he and his family moved to New Orleans, Louisiana. He grew up around its local jazz scene and listened to his mother's CDs on her car stereo, including albums by Céline Dion, Anita Baker, and \"The Phantom of the Opera\" soundtrack...","Raven-Symoné":"David Hyde Pierce was born on 3 April 1959 in Saratoga Springs, New York, USA. He is the youngest child of George and Laura Pierce (both deceased) and has two older sisters (Barbara and Nancy) and an older brother (Thomas). As a child, he was very interested in music (particularly piano) and regularly played the organ at his local church (Bethesda Episcopal Church)...","Bob Harper":"Born Rupaul Andre Charles on November 17 1960, he grew up in San Diego, learning fashion tips from his mother and three sisters. After some time living in Atlanta doing odd jobs such as a used-car salesman, RuPaul moved to New York by the early '90s. He had begun performing in local Manhattan clubs and became a popular attraction through his various flamboyant acts on stage...","Maria Bello":"Tall, spade-jawed, hopelessly genial balladeer/actor Jim Nabors was born in 1930 in Alabama and raised there, graduating from the University of Alabama. A typing clerk at the UN in his salad days, he eventually moved to Los Angeles due to his asthmatic condition and became a film cutter for NBC. Jim was discovered on stage doing a cabaret act at \"The Horn\"...","Chely Wright":"Sean Maher is well known to television and film audiences for his role as 'Dr. Simon Tam' in Joss Whedon's feature \"Serenity\". The film was based on the critically acclaimed series \"Firefly\". Maher was born and raised in New York where he attended the Tisch School of the Arts at NYU. He moved to Los...","Kristian Nairn":"Sean Patrick Hayes was born and raised in the Chicago suburb of Glen Ellyn, Illinois. His father, Ronald, a lithographer, left the family when Sean was a young child. His mother, Mary, works at a food bank, and raised Sean and his four siblings on her own. Sean supported himself as a classical pianist and as a member of a pop band for five years...","Guillermo Díaz":"Clayton Holmes Grissom was born in Raleigh, North Carolina 30 November 1978 to his mother, Faye Aiken Parker and his late father, Vernon Grissom. When Clay was a teenager, he had a love for teaching and helping young children and later on studied to became a school teacher. When he was about 23 years old...","Jonathan Groff":"Rupert James Hector Everett was born in Burnham Deepdale, Norfolk, to Sara (Maclean) and Anthony Michael Everett, a Major in the British Army, who later worked in business. He is of mostly English, Scottish, and Irish ancestry. Everett grew up in privileged circumstances, but the wry, sometimes arrogant...","Lily Tomlin":"Rock Hudson was born Roy Harold Scherer, Jr. in Winnetka, Illinois, to Katherine (Wood), a telephone operator, and Roy Harold Scherer, an auto mechanic. He was of German, Swiss-German, English, and Irish descent. His parents divorced when he was eight years old. He failed to obtain parts in school plays because he couldn't remember lines...","Jonathan Bennett":"Patricia Velasquez was born in Guajira, Venezuela on January 31, 1971, the fifth of six children. She was raised by her parents, both of whom were educators, in a third world country. Needless to say, Patricia's life was far from luxurious. She attended San Vicente de Paul High School, and after her graduation in 1987...","Nathan Lane":"Lucas Cruikshank is a teenage director and actor who got his start by making videos with his cousins John and Katie, and posting them on You Tube. Together, the trio is known as JKL Productions. Lucas decided to make videos by himself a while after he came up with the character you all love, Fred, who is an annoying 6-year-old with an uncaring mother and is most noted for his sped-up voice...","George Takei":"T.R. Knight was a member of the acting company of Minneapolis' Guthrie Theater. Roles there included Richard Miller in Eugene O'Neill's \"Ah, Wilderness!\" and Amadeus in Peter Shaffer's \"Amadeus\". On the New York stage, he portrayed Tim Allgood in \"Noises Off\", Damis in \"Tartuffe\", Joe in \"This Lime Tree Bower\" and Brendan Hilliard in \"Anto Scattergood\"...","Tom Lenk":"Jake Zyrus (known as Charice Pempengco prior to his gender transition) was born in San Pedro, Laguna, Philippines. When he was three years old, he witnessed his abusive father point a gun at his mom during an episode of domestic violence. Along with his mother and younger brother Carl, they left their father in search of a better life...","Jesse Tyler Ferguson":"George Michael was born Georgios Kyriacos Panayiotou in Finchley, north London, in the United Kingdom, to Lesley Angold (Harrison), a dancer, and Kyriacos Panayiotou, a restaurateur. His father was a Greek Cypriot, and his mother was of English background. He first discovered fame as a musician when he and school friend...","Chad Allen":"Freddie Mercury was born on the Tanzanian island of Zanzibar. His parents, Bomi and Jer Bulsara, sent him off to a private school in India, from 1955 til 1963. In 1964, he and his family flew to England. In 1966 he started his education at the Ealing College of Art, where he graduated in 1969. He loved art...","Luke Macfarlane":"David Bowie is widely regarded as one of the most influential writers of popular music. Born David Jones, he changed his name to Bowie in the 1960s, to avoid confusion with the then well-known Davy Jones (lead singer of The Monkees). The 1960s were not a happy period for Bowie, who remained a struggling artist...","Denis O'Hare":"Frank James Michael \"Frankie\" Grande Marchione was born on January 24, 1983 in Boca Raton, Florida, USA. Grande is the older half-brother of singer and actress Ariana Grande. He grew up in Boca Raton, Florida where he attended Pine Crest School. Grande also graduated from Muhlenberg College in 2005...","Ryan Murphy":"Lance Bass is the quintessential illustration of a highly successful and driven jack-of-all-trades: singer, host, actor, producer, writer, entrepreneur, philanthropist and cosmonaut. Beyond his fame as a member of the phenomenally successful group *NSYNC, where the group sold an impressive 60 million plus records worldwide...","Drew Barrymore":"Billie Joe Armstrong was born in Piedmont, California, a small town surrounded by the city of Oakland, and was raised in Rodeo, California, the youngest of six children of Ollie (Jackson) and Andrew \"Andy\" Marsicano Armstrong. His father worked as a jazz musician and truck driver for Safeway Inc. to support his family...","Andrew Rannells":"Amy Winehouse was a five-time Grammy Award-winning English singer-songwriter known for such hits as 'Rehab' and 'You Know I'm No Good' among her other works. She was born Amy Jade Winehouse, on September 14, 1983, in Enfield, London, England to a Jewish family with Russian ancestry on her mother's side...","Gillian Anderson":"In September, the 13 Reasons Why actor identified himself as part of the LGBT community in an Instagram post.","Sam Smith":"The Arrested Development star came out casually in a May interview with Out magazine. ","Frank Ocean":"In August, the former child star came out as bi in an emotional message on Twitter.","David Hyde Pierce":"The Heroes actor came out in July in an Instagram post where he declared, “I am indeed a man who proudly loves other men. In fact, this April, I married my husband and I could not be happier.” ","Maulik Pancholy":"The hunky Younger actor came out to People magazine in October, explaining it was his recent marriage to boyfriend Eric Beric that fueled his desire to be more open. ","Robin Roberts":"Pro wrestler Anthony Bowens came out as bisexual in March, crediting a YouTube video for giving him the courage to be his authentic self. ","RuPaul":"Gavaris plays gay BFF Felix on Orphan Black, but it wasn’t until June that the 27-year-old came out as gay in real life. “Nobody ever asks me,” he revealed. “I’ve never been asked. Like, the whole course of the series.” ","Jenna Wolfe":"LCD Soundsystem’s resident electronics whiz came out as trans in July, explaining that over the past year-and-a-half, “I went from my trans identity being something I was in touch with and worked through in one way or another, to suddenly this shift where it’s on the front burner. ","Jim Nabors":"Now 19, Chance became a viral sensation with his performance of Lady Gaga’s “Paparazzi” at a school talent show when he was just 12. ","Sean Maher":"Smith, who played cis male roles on shows like Blue Bloods, Girls, Person of Interest, and Gossip Girl, came out as transgender when he appeared on an episode of OWN’s Queen Sugar in July, playing police officer Toine Wilkins, a trans man. ","Sean Hayes":"This veteran NBA player didn’t just come out in a July ESPN profile, she revealed she was dating soccer star Megan Rapinoe. ","Adam Lambert":"The longtime Fox News anchor came out in a subtle way just days after National Coming Out Day 2016. ","Clay Aiken":"Before coming out as trans on Twitter, Jake was best known as Sunshise Corazon, Rachel Berry’s golden-voiced nemesis on Glee. ","Rupert Everett":"Morales, best known for playing Tom Haverford’s girlfriend Lucy on Parks and Recreation, came out as queer in July.","k.d. lang":"Lonsdale, who plays Kid Flash on the CW’s The Flash, came out as bisexual in a heartfelt Instagram post back in May.","Rock Hudson":"Manilow addressed his long-rumored sexuality in April, three years after quietly marrying longtime partner and manager Garry Kief.","Anne Heche":"This rising hip-hop star came out as gay in January in a series of tweets. ","Jussie Smollett":"The brother of Chance the Rapper, Bennett came out as bisexual in January just days before iLoveMakonnen. ","Patricia Velasquez":"The 19-year-old member of the Internet has produced tracks for Kendrick Lamar and Vampire Weekend, and launched his debut solo record, Steve Lacy’s Demo this year.","Joel Grey":"Though he’s been accused of homophobia throughout his career—2011’s Goblin had 213 instances of the word “fag” and other anti-gay slurs—Tyler has also dabbled with gay innuendo. ","Lucas Cruikshank":"Though best known for the 1980s nighttime soap Dynasty, Thomson didn’t come out until September, opening up about his struggle with his sexuality to the Daily Beast. ","Cheyenne Jackson":"In August Sleiman (Nurse Jackie,  The Ski Trip) came out rather bluntly on social media.","David Furnish":"The former Drag Race contestant came out as trans in March on International Transgender Day of Visibility. ","T.R. Knight":"The CMT host came out as gay in January, telling People, “once I realized it was okay to accept the truth, that it wasn’t my choice, it was a lot easier to start figuring out where to go with my life next.” ","Jake Zyrus":"Coming out never looked so good.","George Michael":"From movie stars to country music artists, people came out of the closet in droves in 2014. Perhaps a byproduct of societal approval, or thanks to the tidal wave of legislative victories, LGBT Americans are feeling increasingly encouraged not only to accept their sexuality and gender identity but to feel comfortable asserting that identity in public.","Jake Shears":"As Mic has previously noted, \"coming out\" is something of a watershed moment in the life of an LGBT person. It is the moment when they put all their cards on the table and then wait to see if society accepts their true identity or not. There is also a larger purpose to the act: Each coming out story raises awareness of the community and humanizes various minority representations. ","Linda Perry":"In 2014, several individuals in the national spotlight chose to come out. Here are some of the people (many of whom had previously spent years in the closet) who bravely took one giant leap for LGBT-kind this year.","Rob Halford":"Technically, the Good Morning America anchor came out at the very tail end of 2013. But her decision, after years of speculation and nearly a decade spent with her partner in the face of more than one terminal illness, was arguably the greatest coming-out of the year. For all athletes, women and especially women of color, Robin Roberts is a true champion.","Freddie Mercury":"Fans learned to love her as the sardonic, titular star of the movie Juno. But now the actress has grown up and came out in front of hundreds at an event called Time to THRIVE, which was held by the Human Rights Campaign. The now 27-year-old actress's touching, candid speech brought more than a few to tears.","David Bowie":"Country music star Herndon always knew he was gay, but remained in the closet for the sake of his career in a relatively conservative field. At age 52, that finally changed. \"I was 10, sitting in church and horrified that I might be a homosexual. Whatever that word meant, I knew that I probably was one,\" the singer told Rolling Stone. \"And I know there's a lot of those kids still out there. Telling my story is an opportunity to help just one of them.\"","Mika":"After years of speculation, and at least one accidental outing (most recently by a CNBC co-host), Tim Cook came out in an op-ed in Bloomberg Businessweek in October. While never officially in the closet, Cook felt it imperative to come out publicly as a token of goodwill and to offer support to queer youth. \"If hearing that the CEO of Apple is gay can help someone struggling to come to terms with who he or she is, or bring comfort to anyone who feels alone, or inspire people to insist on their equality, then it's worth the trade-off with my own privacy,\" he wrote in the piece.","Frankie Grande":"After achieving his first chart-topper at the age of 11, this country music star came out just last week at the age of 26. In a YouTube video, he explains why he waited until now to be open about his sexuality. \"It's difficult for me to make this video,\" he says, \"not because I'm ashamed of being a gay male artist, or a gay artist, or a gay person. But it's pretty silly to know that I'm ashamed of doing this ... because I'm in a genre, in an industry, that is ashamed of me for being me.\"","Lance Bass":"Former lead singer of the band Misster, Jin Tai made headlines in late November when she became Taiwan's first \"out\" pop music star at age 32. The Gay Star News cites a China Times report that Tai \"wanted to honestly face her past and future, including her relationship status.'\"","Billie Joe Armstrong":"In the years following his Olympic victories, Australia's greatest swimming champion apparently suffered for years from depression, as well as alcohol and drug abuse. The 31-year-old, five-time Olympic gold medalist came out in July after spending time in rehab. \"I've wanted to [come out] for some time, but I couldn't, I didn't feel as though I could. What happened was I felt the lie had become so big that I didn't want people to question my integrity,\" he revealed in an interview with Australia's Network Ten, as reported by the Guardian. ","Amy Winehouse":"Christian music star Vicky Beeching's coming out this past summer ignited heated debate about homosexuality and religion. \"Arguaby the most influential Christian of her generation,\" to quote Peter Oremerod at the Guardian, Beeching became a LGBT icon when she took on and decisively shut down the bigoted arguments of a Christian fundamentalist in the following BBC debate: ","Brandon Flynn":"Believed to be the first national beauty queen to be lesbian, Rodríguez won the Miss Spain pageant in 2008 and 2013. She came out this August, when she posted photos of herself with girlfriend, DJ Vanesa Cortes, on Instagram.","Alia Shawkat":"The 22-year-old British singer-songwriter took the U.S. charts by storm this year, but he truly won our hearts in May when he came out after speculation about the person-of-desire alluded to in his song, \"Leave Your Lover.\" \"It's about a guy, and that's what I wanted people to know – I want to be clear that that's what it's about,\" Smith said in an interview with Rolling Stone. ","Aaron Carter":"  ","Thomas Dekker":"Raven pulled a That's So Raven twist when she came out without actually coming out — or, at least refusing to appropriate identity labels. The now-viral interview with Oprah ended years of speculation about the former Disney star's love life. Still, there's certainly nothing wrong with living life without labels. ","Dan Amboyer":"Inspired perhaps by her writing — or at the very least being in close proximity with so many amazing queer influences  — on the set of Orange Is the New Black, writer Lauren Morelli officially \"came out\" in an op-ed piece here at Mic over the summer. Tabloids, not to mention the lesbian media, went bonkers when news broke that she had divorced her husband for none other than OITNB's Samira Wiley.","Anthony Bowen":"Kristian Nairn, who plays the almost completely mute character Hodor, came out in an interview with a Game of Thrones fansite in May. But the Irish actor maintains he's never technically been in the closet: \"I've never hidden my sexuality from anyone, my whole life in fact,\" he told the fansite Winter Is Coming, \"and I've been waiting for someone to ask about it in an interview, 'cause it's not something you just blurt out. I've tried to lead the questions a few times, to no avail!\"","Jordan Gavaris":"The Mean Girls star's most famous role may have been as the uber-flamboyant high school student Damian, but Franzese only officially came out in 2014. In a touching letter written to his Mean Girls  character and shared on social media, the 26-year-old actor touched on his own fears about coming out in an industry often preoccupied with a set of very specific masculinity standards. Franzese remained in the closet for so long, he contends, because he \"was meeting a 'gay glass ceiling' in casting\" and didn't want to be denied more masculine roles. \"Guidos, gangsters and goombahs,\" he says, \"were [his] specialty.\" ","Gavin Russom":"R. Kelly's son, Jay, came out as trans this summer on Ask.fm. Later in June, R. Kelly appeared to intentionally misgender Jay. But Jay's mother, Drea, later refuted and corrected in an interview with VH1. \"Parents get it wrong when they don't support their children,\" she said. \"They have to go out and fight every day and face this world. The first battle should not be at home. I think that a lot of children in the LGBT community don't succeed because the one thing they need the most is foundation. I just tell Jay all the time, baby, you won the war. You're gonna have a lot of battles, but you won the war. Mama accepts and loves you for who you are.\"","Greydon Chance":"Neon Trees frontman Tyler Glenn made headlines for coming out this spring — not just for being gay, but for being a gay Mormon. In his coming-out interview with Rolling Stone, Glenn said he's ready to be a gay rock star: \"I've gotten tired of kind-of gay or straight people being pop culture's gay [spokespeople] – like Macklemore. It makes me wonder, 'Are we ready for an actual gay pop star and not just the safe straight guy saying it's OK?' I appreciate the fact that Michael Stipe was able to just be who he was, and it rarely overshadowed the music.\"","Brian Michael Smith":"One of the stars of FX drama The Bridge, Emily Rios, came out during a TCA FX interview this summer. As reported by AfterEllen, Rios, whose character, Emily, is also a lesbian on the show, said, \"I'm gay, personally, so being Mexican and a lesbian — this is why I love the character because I deal with the same type of things with my own family. Mexican-Americans especially — because this generation, we come into America and your family wants to be proud. You want to come to this country and say, 'This is what I have to show for it. I brought my family and we're living our better life.' For my family, my mom didn't want me to live a difficult life. She brought me here for a better one so she's like 'Your coming out ... I don't want this to be this. I want you to be comfortable.'\"","Sue Bird":"Trent came out as queer in a personal blog post in March inspired, she told Sirius XM Progress, by the need to clear things up with her friends about her political beliefs. \"They were not for gay and lesbian marriages,\" she said, as quoted at the Huffington Post. \"And it just kind of fired me up a little bit. So I sat down at my computer and I just started typing away and that is what came.\" It was also imperative, she said, for her to have come out as a queer women of color. \"People need to be able to see more people who look like them,\" she says.","Shepard Smith":"This spring, model Geena Rocero came out as transgender in one of the most epic ways possible: as part of a TED Talk (below). At the same time, Rocero used the platform to announce the creation of a global campaign, Gender Proud, which she hopes will raise awareness and support for trans issues and communities across the globe.","Natalie Morales":"Out Magazine's \"Ingenue of the Year\" wowed many fans the moment she hit screens as part of the sensible cast for OITNB. Her character, Pousséy, is a lesbian on the show. Her struggle with the emotional impact of an unrequited love affair with her best friend Taystee is arguably one of the most compelling plot lines. In real life, Wiley is anything but struggling, due to her widely reported relationship with writer Lauren Morelli. ","Keiynan Lonsdale":"Following in the footsteps of the NBA's Jason Collins, Derrick Gordon became the first active Division I basketball player to come out in an interview with ESPN/Out Sports in April. \"I just didn't want to hide anymore, in any way,\" the UMass redshirt junior told the network. \"I didn't want to have to lie or sneak. I've been waiting and watching for the last few months, wondering when a Division I player would come out, and finally I just said, 'Why not me?'\"","Barry Manilow":"Michael Sam made history by becoming the first gay athlete to be drafted into the NFL. Even though he was officially cut from the league by the Dallas Cowboys before the start of the 2014 season, Sam's decision to go public with his sexuality before the draft will make the next gay NFL prospect's life incredibly easier. The moment he was drafted was recorded on video, and the kisses he shared with his boyfriend sparked an important conversation on social media about the way the media far too often sensationalizes coverage of LGBT athletes.","iLoveMakonnen":"Although LGBT singers like Adam Lambert and Clay Aiken get a lot of credit for their high-powered American Idol turns, Nobilette is the first Top 10 American Idol finisher to be come out as openly LGBT during the competition. While some suggest her sexuality is the reason she didn't advance further, Nobilette says that revealing her sexuality was imperative to her authenticity. \"I feel like if I want America to get to know me and who I am, they should know my sexuality,\" she told the Hollywood Reporter.","Taylor Bennett":"Professional distance runner Matt Llano came out this fall in a YouTube video, \"An Open Look,\" sponsored by the Northern Arizona Elite running club. After receiving waves of support, Llano told Out Sports that coming out was one of the greatest decisions of his life. \"It's not all that common for athletes to have an opportunity to transcend their sport and to touch people's lives for the better,\" he said. \"So knowing that I've been able to do that truly gives meaning and purpose to my running and is something for which I'll be eternally grateful.\" ","Steve Lacy":null,"Tyler, the Creator":null,"Gordon Thomson":null,"Haaz Sleiman":null,"Gia Gunn":null,"Cody Alan":null,"Ty Herndon":null,"Tim Cook":null,"Billy Gilman":null,"Jin Tai":null,"Ian Thorpe":null,"Vicky Beeching":null,"Former Miss Spain Patricia Yurena Rodríguez":null,"Raven-Symone":null,"Lauren Morelli":null,"Daniel Franzese":null,"Jay Kelly ":null,"Tyler Glenn":null,"Emily Rios":null,"Former Miss Kentucky Djuan Trent":null,"Geena Rocero":null,"Andreja Pejic":null,"Samira Wiley":null,"Derrick Gordon ":null,"Michael Sam":null,"M.K. Nobilette":null,"Matt Llano":null}
