2017/VladislavStukov/hw-4/app/views/articles/show.html.erb


  <% if @article.comments.any? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]