[{"actors":"Sarah Paulson","info":"Paulson’s career has been on an upward trajectory over the past several years, with her work in American Horror Story and American Crime Story making her a household name. She has dated both women and men throughout her life, and has been in relationships with actresses Cherry Jones and Holland Taylor. Paulson prefers not to put labels on her sexuality, but said that it is ‘fluid’ in a 2014 interview."},{"actors":"Drew Barrymore","info":"Drew Barrymore was one of the world’s most famous child actresses, and transitioned into a successful acting and business career as an adult. Barrymore is one of the most visible celebrity bisexuals in the world, and discussed her sexuality in several interviews in the early 2000’s. She is currently married to art consultant Will Kopelman and has two children with him, although they recently announced their intent to divorce."},{"actors":"Megan Fox","info":"The famously outspoken actress came out as bisexual in 2011 in an interview with Esquire magazine. However, she has been married to actor Brian Austin Green since 2010. She has alluded to relationships with women in her past in several interviews. Fox has been seen in many of the Transformers movies, as well as appearing on the Fox comedy New Girl recently."},{"actors":"Alan Cumming","info":"The well-known theatre and movie actor has had relationships with men and women, and is currently in a happy marriage with graphic artist Grant Shaffer. He is very open about his bisexuality, and has discussed it in several interviews, as well as in his memoir. Cumming has most recently starred in the popular CBS drama The Good Wife."},{"actors":"Angelina Jolie","info":"Although Jolie’s marriage to Brad Pitt has long been a tabloid fixture, she has been openly bisexual for most of her career. In 1997, she discussed her then-relationship with model and co-star Jenny Shimizu with ABC’s 20/20. She has also played many lesbian and bisexual roles onscreen."},{"actors":"Michelle Rodriguez","info":"This American actress is known for playing tough, fiercely independent women, and has starred in many action movies throughout her career. She is particularly known for her work in the Fast & Furious movies, as well as appearing on the popular TV show Lost. Although there has been speculation about her sexuality since 2006, she did not come out as bisexual until 2013, in interviews with magazines such as Entertainment Weekly and Latina."},{"actors":"Anna Paquin","info":"Paquin came out as bisexual in 2010 in a public service announcement for the True Colours fund, and had discussed sexuality in interviews prior to that time. She is married to Stephen Moyer, her former True Blood co-star. Paquin is an Academy Award-winning actress for her work in The Piano, which was filmed when she was only 11 years old."},{"actors":"Kesha","info":"The pop star has discussed her sexuality in several interviews over the years, saying that she doesn’t ‘love just men’, and that she just ‘likes people’. She advocates against bullying, particularly bullying of members of the LGBT community. Kesha is known for songs such as ‘Tik Tok’ and ‘Die Young’."},{"actors":"Billie Joe Armstrong","info":"The Green Day lead singer has been open about his sexuality for over twenty years, saying “I think I’ve always been bisexual.” He has discussed the subject with many different magazines over the years, including The Advocate, Out, and Rolling Stone. Armstrong has been married to his wife, Adrienne, since 1994, and has two children."},{"actors":"Evan Rachel Wood","info":"Wood has been featured in many acclaimed movies throughout the years, most notably Thirteen and The Ides of March. She came out as bisexual via Twitter in 2012. She previously dated musician Marilyn Manson, and was also married to actor Jamie Bell."},{"actors":"Jillian Michaels","info":"Michaels is considered one of the world’s most famous fitness experts, and has been featured on the television shows The Biggest Loser and Losing It With Jillian. She is engaged to Heidi Rhodes, whom she has two children with, one of whom is adopted from Haiti. Michaels has previously stated her preference for “healthy love”, regardless of what gender her partner is."},{"actors":"Amber Heard","info":"Actress Amber Heard came out as bisexual in 2010, and since has dated both photographer Tasya Van Ree and actor Johnny Depp, whom she married in 2015. Heard has been featured in many popular films, including Pineapple Express, Zombieland, and The Danish Girl. She is also a prominent celebrity activist, working for many LGBT organizations."},{"actors":"Tom Hardy","info":"The British actor had his breakthrough in 2010 with Christopher Nolan’s hit film Inception, and has since been featured in many critically acclaimed movies. He has been married to wife Charlotte Riley since 2014. However, he has admitted to having sexual relations with many men in his youth."},{"actors":"Jessie J","info":"British pop singer Jessie J has released several hit singles since the release of her debut album in 2011, and is also a successful songwriter. She has discussed her bisexuality openly throughout her career, saying that she has dated both men and women. She is currently dating singer Luke James."},{"actors":"Carrie Brownstein","info":"Brownstein is known as an indie rock icon for her work with the band Slater-Kinney, and is also known for starring on and writing for television show Portlandia. As a member of Slater-Kinney, she was outed at 21 years old by Spin magazine, and later confirmed her bisexuality in 2010. She is currently single, but is very close with co-star Fred Armisen."},{"actors":"Gillian Anderson","info":"It is safe to say that every ’90s person has heard of Gillian Anderson. Well, except for these younger generations that probably have no idea who she is (which is really unfortunate for them because she’s an amazing actress). Gillian Anderson is an American actress mostly known for her iconic role of Dana Scully in the the cult sci-fi series The X-Files. Anderson was always open about her life and her relationships, but it wasn’t until 2012 that she revealed that, beside men, she also had relationships with women. Yes, in an interview for Out magazine Gillian Anderson came out as bisexual. “I was in a relationship with a girl for a long time when I was in high school,” said Anderson, adding however that her relationships with women “have been the exception, not the rule.”\n "},{"actors":"Ezra Miller","info":"This handsome 24-year-old American actor is mostly known for his roles in movies such as We Need to Talk About Kevin, The Perks of Being a Wallflower, and Trainwreck (he will also play Barry Allan a.k.a. The Flash in the DC Extended Universe and we seriously can’t wait to see that). Speaking about his sexuality, Miller simply said: “I’m queer,” adding, however, that he is still “trying to figure out relationships”. When people started labeling him as gay, he explained: “The way I would choose to identify myself wouldn’t be gay. I’ve been attracted mostly to ‘shes’ but I’ve been with many people and I’m open to love wherever it can be found.” Miller also shared that he was called an offensive gay slur and punched in the face (he still has a scar on his eyebrow) when he was in middle school.\n "},{"actors":"Marlon Brando","info":"The late Marlon Brando was a legendary actor. Some people even consider him to be one of the best actors ever. But one thing is for sure, he was a game changer. And should we even talk about his looks? To say that Brando was very handsome would be an understatement. He could definitely compete for the title of Hollywood’s most handsome actor ever. And let’s be real, he’d probably win. No wonder so many women fell for him. However, what was surprising (maybe even shocking, for that period) is that Brando was bisexual. In a 1976 interview with Gary Carey, Brando said: “Homosexuality is now so much in fashion it no longer makes news. Like a large number of men, I, too, have had homosexual experiences, and I am not ashamed. I have never paid much attention to what people think about me.”\n "},{"actors":"Megan Mullally","info":"You all remember sarcastic, but hilarious Karen from Will & Grace, right? Well, of course you do, she was the biggest reason why we watched that show. Honestly, they should have named it Will & Karen. Or simply Karen. Well, Megan Mullally, the actress who play the iconic Karen is another bisexual celebrity we decided to include on this list. Back in 1999, a year after the premiere of Will & Karen – sorry, we meant Will & Grace, Mullally came out as bisexual. “I consider myself bisexual, and my philosophy is, everyone innately is, although I’ve never had a full-on relationship with a woman, just a couple of what I’d term half-assed dalliances, ” she said in an interview for The Advocate. And 11 years later, in 2010, she confirmed that once again, for the same magazine: “I do think everyone’s innately bisexual, but, as you know, people acknowledge that or realize that in themselves to lesser or greater degrees. Some people are completely unaware of it, and some people are very in touch with it.”\n "},{"actors":"David Bowie","info":"“I’m gay, and always have been, even when I was David Jones,” said David Bowie in 1992, for Melody Maker, an English magazine. However, just a few months later, after the release of his song “John, I’m Only Dancing”, the “Space Oddity” singer revealed that he is actually bisexual. “It’s true —  I am a bisexual. But I can’t deny that I’ve used that fact very well. I suppose it’s the best thing that ever happened to me,” told Bowie to Playboy. But what does the song have to do with him coming out? Well, “John, I’m Only Dancing” is apparently about a gay relationship — the narrator is telling his boyfriend not to be concerned about the girl he’s dancing with.Fun fact: According to Angela Bowie, David’s first wife, he had a relationship with Mick Jagger.\n "},{"actors":"Fergie","info":"Stacy Ann Ferguson, better known as Fergie is a pretty big name in the music industry. She was a member of the band The Black Eyed Peas, plus she also has a very successful solo career. However, her coming out as bisexual shocked a lot of people. Speaking about her affection towards both, men and women, Fergie said: I think women are beautiful. I’ve had a lot of fun with women, and I’m not ashamed of it. The problem is that I also love a well-endowed man.” The “Fergalicious” singer also explained that she’s completely honest with her husband, Josh Duhamel, and that she’s not planning to have relationships with women while she’s married to him.  “But just because I enjoy women doesn’t mean I’m allowed to have affairs in my relationship. I learned through talking with my therapist that it is still cheating even if it’s with girls, so there is a rule there,” Fergie concluded.\n "},{"actors":"Lady Gaga","info":"Lady Gaga has been a supporter of the LGBTQ community since the day one of her career as a singer. Do you know her song “Poker Face”? Of course you do, everybody knows it. Well, did you know that “Poker Face” is actually about bisexuality? According to the new Queen of Pop, as a lot of media calls her, “Poker Face” is about having sex with a man while fantasizing about a woman at the same time. So yes, Gaga bisexual, and she is pretty open about. “It’s not a lie that I am bisexual and I like women, and anyone that wants to twist this into ‘she says she’s bisexual for marketing,’ this is a f–king lie. This is who I am and who I have always been,” said Gaga a few years ago.\nWe believe you Gaga, you were born that way."},{"actors":"Amy Winehouse","info":"We all know the immensely talented Amy Winehouse. Not only did she amaze us with her breezy and sexy voice, but with her numerous hits making us turn up the radio right away. Apart from all this, she was undeniably troubled. Indeed, during her best years on stage, she had been asked about her sexual preferences many times. Specifically, when she got asked about her sexy girl tattoos back in the day, Winehouse would always say that she liked pin-up girls. After all, she often would consider herself a girl that really finds herself among boys most of the time.Also, rumors have it that she did wreck a lesbian couple’s romance back then following her making out with a girl on a hammock.“So what? I like girls as well, I’ve had relationships with … There is something about being with a woman that is very satisfying. I don’t care what people think about me being bi — I do what feels good”. At least, this is how she would react to such biting comments thrown at her.  Amy died at the age of 27 probably due to an alcoholic poisoning. As for her musical career, her album entitled Back to Black became the UK’s best-selling album of the 21st century.\n "},{"actors":"Jodie Foster","info":"Really?! Totally! Referred to as one of the best and most talented actresses of all times, Jodi has just found another way to steal the show and make us turn our heads after her. Believe it or not, she’s happened to be, well, painfully honest about many of her  relationships. Actually, it seems like she hasn’t been 100 % open with her boyfriends, and, frankly, the reason why it hardly ever works with them is the fact that she likes women. It’s as simple as 1, 2, 3. Besides, Jodie tied the knot with her girlfriend about 3 years ago.\n "},{"actors":"Jonathan Bennet","info":"Oh, seven heavens – Jonathan Bennet?! Seriously?! What is he doing on this roundup of 15 hot celebs who’ve come out as bisexual? Exactly. Out of all of our fresh examples today, maybe Mr. Jonathan is indeed the greatest shock and handsome disappointment, to say the least. We simply can’t deny the truth given all his female fans dying for his toned abs. Well, it’s just abs after all, but guys seem to take a massive liking to this nice feature too. Besides, who could have known about his secretive past as a bisexual individual when you think about his movie characters as a high-school graduate, bad boy, etc.? That’s the point.\n "},{"actors":"James Franco","info":"James, how could you? We do have the right to tease him a bit, right? Honestly, James Franco’s openness about his sexual orientation did really break ladies’ hearts a few years ago. After all, how could you expect girls not to like him given all his quite nude on-set moments? With this in mind, it definitely seems like all these juicy on-screen scenes have really been filmed in vain. Or maybe not – the world of Hollywood has enough fresh instances of hot and talented guys who may take a deep liking to his well-shaped body and faked masculinity anyway.\n "},{"actors":"Jim Parsons","info":"Ladies, your wildest dreams of meeting the prince on a white horse named Jim Parsons, have just bitten the dust. Unfortunately, he’s turned out to be gay, or at least bisexual anyway! At least that crazy Big Bang theory has finally been disclosed! All jokes aside, sometimes it’s so difficult to believe that some of America’s favorite characters making out on-screen have been bisexual or 100 % gay without us having the slightest clue of it all. But, at the end of the day, everyone needs to find their own path and follow it, to put it simply. Therefore, it doesn’t matter if Jim’s intimate partner is a guy or a girl as long as he’s happy with his life.\n "},{"actors":"Kristen Stewart","info":"If you have seen her epic Twilight moments, then you’re certainly aware of the overly annoying melodrama that has been a great on-screen trend for some time. Is she or isn’t she bisexual anyway? With all of her hot and heavy on-set scenes with her on-and-off boyfriend and a co-star, we’ve had such a hard time deciding whether she likes guys or women more. Actually, it’s not like we have scarcely seen leaked photos of her making out with other hot girls, but, eventually, it’s quite challenging to classify her at the end of the day. Gay or not, she’s certainly crossed the line and joined the “other side”, if you know where we’re going with this one…\n "},{"actors":"John Travolta","info":"Frankly said, there’s barely another famous person’s sexuality that gets more discussed than John Travolta’s! All in all, is he gay or is he NOT gay? Society’s got a hard choice to make. All jokes aside, it seems like all kinds of crazy and bizarre rumors love surrounding the unique individuality of this great actor. It’s undeniable that he’s partaken in some pretty decent movies all his life, playing compelling characters. It’s all good when it comes to his acting skills. However, behind the scenes we’ve heard enough rumors to put into question Mr. Travolta’s sexual orientation. We’re really confused about it given all those year-long rumors about his sexual preferences.\n "},{"actors":"Wentworth Miller","info":"Well, sometimes we may think that we truly know our favorite action movie stars. But, indeed, there are always a bunch of little-known, and quite quirky to be honest, facts all these celebs wish we could never ever reveal about them. In this sense, there’s no other instance of a widely-known and well-recognized actor than the British-American star named Wentworth Miller. If this name doesn’t ring a bell to you right away, let us send you on a trip down memory lane.Are you a fan of the Prison Break series? Bingo. That’s about right. With his well-shaped body all covered in tattoos hiding juicy getaway codes, Michael Scofield has actually been bisexual all these years without us realizing it. Now we’re pretty sure you’re kind of disappointed, aren’t you, ladies?"},{"actors":"Neil Patrick Harris","info":"Legen.. wait for it ….daryHow I Met Your Mother’s crowning and prestigious womanizer, Neil Patrick Harris, publicly confessed that he was gay and happy with David Burtka. It is said, that women around the world collectively squinched. Some embraced lesbianism referring that there was no hope left in men, some took up Buddhism asserting there was no hope left in the world. That’s why they say ‘Gay Celebrities can’t be recognized with bare eyes’."},{"actors":"Ian McKellen","info":"Award-winning Ian McKellen, best known for his role as Gandalf in ‘Lord of the Rings’ and ‘The Hobbit’ trilogies, is living openly about being gay for along time. He regrets that he didn’t come out publicly sooner."},{"actors":"Josh Hutcherson","info":"‘Hunger Games’ star identifies himself as “mostly straight” these days, but said, “Maybe I could say right now I’m 100% straight. But who knows about the future?It’s unpredicted as in  any good month of any year, I could coincidentally meet a guy and I’m attracted to this person.”"},{"actors":"Michelle Rodriquez","info":"In an interview with Entertainment Weekly, the hot and sensuous actress came out as bisexual last October 2013 . Michelle commented,”I’ve gone both ways. I do as I please. I am too f**king curious to sit here leisure and not try when I can. Men are intriguing. but don’t deny about chicks.”"}]
