2017/VladislavStukov/hw-4/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.order(:id).reverse_order.page(params[:page])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "contact_data" = $1, "sold_bonsticks" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["contact_data", "21341243"], ["sold_bonsticks", "t"], ["updated_at", "2017-12-01 21:19:28.436061"], ["id", 4]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)