2017/VladislavStukov/hw-4/app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "contact_data") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["commenter", "vfvf"], ["body", "vffv"], ["article_id", 9], ["created_at", "2017-12-03 12:18:24.451320"], ["updated_at", "2017-12-03 12:18:24.451320"], ["contact_data", "vfvf"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)