2017/VladNegure/4/app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:comment][:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
INSERT INTO "comments" ("text", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "12345678"], ["post_id", 2], ["created_at", "2017-11-27 18:14:20.635095"], ["updated_at", "2017-11-27 18:14:20.635095"]]