2017/VladNegure/4/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 5)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
  def show
    @comments = @post.comments.paginate(page: params[:page], per_page: 10)

INSERT INTO "posts" ("title", "bonsticks", "bitcoins", "description", "contacts", "operation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Buying and selling"], ["description", "Hello im bob and i want to be rich"], ["updated_at", "2017-11-24 16:42:31.326203"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)